# Pandas : Library for data analysis and manipulation

# It is a library that provides ability to work with Tabular data.

In [17]:
import pandas as pd

# Series is a one dimensional lebelled array that can hold/store data.

In [18]:
mybooks = ['b1','b2','b3','b4']

In [19]:
book_title = pd.Series(mybooks, index=['a','b','c','d'])  #defining specific indexes for the list elements using 'index' parameter.
book_title

a    b1
b    b2
c    b3
d    b4
dtype: object

In [20]:
type(book_title)

pandas.core.series.Series

# DataFrame -
# 2D labelled array having index and columns.
# multiple series combined together to form a dataframe.
# it is a widely used data structure in Pandas.

In [21]:
import numpy as np

In [22]:
arr = np.random.randint(10,100,size=(6,4)) # creating a maxtrix of random numbers using numpy array
arr

array([[73, 84, 53, 13],
       [82, 42, 54, 55],
       [43, 97, 18, 29],
       [15, 77, 68, 26],
       [37, 71, 41, 65],
       [97, 26, 93, 84]])

In [23]:
df = pd.DataFrame(data = arr) # creating a data frame from the matrix
df

    0   1   2   3
0  73  84  53  13
1  82  42  54  55
2  43  97  18  29
3  15  77  68  26
4  37  71  41  65
5  97  26  93  84

# changing the column name

In [24]:
df = pd.DataFrame(data = arr,columns=['A','B','C','D'])
df

    A   B   C   D
0  73  84  53  13
1  82  42  54  55
2  43  97  18  29
3  15  77  68  26
4  37  71  41  65
5  97  26  93  84

In [25]:
df.columns = ['A','B','C','D']
df

    A   B   C   D
0  73  84  53  13
1  82  42  54  55
2  43  97  18  29
3  15  77  68  26
4  37  71  41  65
5  97  26  93  84

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
# fetching the top three rows
df.head(n=3)

    A   B   C   D
0  73  84  53  13
1  82  42  54  55
2  43  97  18  29

In [28]:
# fetching the bottom three rows
df.tail(n=3)

    A   B   C   D
3  15  77  68  26
4  37  71  41  65
5  97  26  93  84

In [29]:
# ectracting a specific column
df['C']

0    53
1    54
2    18
3    68
4    41
5    93
Name: C, dtype: int32

In [30]:
# ectracting several columns
cols = ['A','C']
df[cols]

    A   C
0  73  53
1  82  54
2  43  18
3  15  68
4  37  41
5  97  93

In [31]:
# adding the values of two columns
df['A+B'] = df['A']+df['B']
df

    A   B   C   D  A+B
0  73  84  53  13  157
1  82  42  54  55  124
2  43  97  18  29  140
3  15  77  68  26   92
4  37  71  41  65  108
5  97  26  93  84  123

In [32]:
df['A-B'] = df['A']-df['B']
df

    A   B   C   D  A+B  A-B
0  73  84  53  13  157  -11
1  82  42  54  55  124   40
2  43  97  18  29  140  -54
3  15  77  68  26   92  -62
4  37  71  41  65  108  -34
5  97  26  93  84  123   71

In [33]:
# removing a column
df.drop(columns=['A-B'],inplace=True)
df

    A   B   C   D  A+B
0  73  84  53  13  157
1  82  42  54  55  124
2  43  97  18  29  140
3  15  77  68  26   92
4  37  71  41  65  108
5  97  26  93  84  123